STMicroelectronics/x-cube-memsmic1/Drivers/CMSIS/Device/ST/STM32WBxx/Include/stm32WBxxxxx.h
/* Definitions for cohabitation of ADC peripherals 2.5Ms/sec and 5Ms/sec across STM32WB series */
#define ADC_DR_RDATA_Pos               ADC_DR_DATA_Pos
#define ADC_DR_RDATA_Msk               ADC_DR_DATA_Msk
#define ADC_DR_RDATA                   ADC_DR_DATA

#if !defined (STM32WB15xx) && !defined (STM32WB10xx) && !defined(STM32WB1Mxx)
/********************  Bit definition for ADC_AWD2CR register  ****************/
#define ADC_AWD2CR_AWD2CH_Pos          (0U)
#define ADC_AWD2CR_AWD2CH_Msk          (0x7FFFFUL << ADC_AWD2CR_AWD2CH_Pos)    /*!< 0x0007FFFF */
#define ADC_AWD2CR_AWD2CH              ADC_AWD2CR_AWD2CH_Msk                   /*!< ADC analog watchdog 2 monitored channel selection */
#define ADC_AWD2CR_AWD2CH_0            (0x00001UL << ADC_AWD2CR_AWD2CH_Pos)    /*!< 0x00000001 */
#define ADC_AWD2CR_AWD2CH_1            (0x00002UL << ADC_AWD2CR_AWD2CH_Pos)    /*!< 0x00000002 */
#define ADC_AWD2CR_AWD2CH_2            (0x00004UL << ADC_AWD2CR_AWD2CH_Pos)    /*!< 0x00000004 */
#define ADC_AWD2CR_AWD2CH_3            (0x00008UL << ADC_AWD2CR_AWD2CH_Pos)    /*!< 0x00000008 */
#define ADC_AWD2CR_AWD2CH_4            (0x00010UL << ADC_AWD2CR_AWD2CH_Pos)    /*!< 0x00000010 */
#define ADC_AWD2CR_AWD2CH_5            (0x00020UL << ADC_AWD2CR_AWD2CH_Pos)    /*!< 0x00000020 */
#define ADC_AWD2CR_AWD2CH_6            (0x00040UL << ADC_AWD2CR_AWD2CH_Pos)    /*!< 0x00000040 */
#define ADC_AWD2CR_AWD2CH_7            (0x00080UL << ADC_AWD2CR_AWD2CH_Pos)    /*!< 0x00000080 */
#define ADC_AWD2CR_AWD2CH_8            (0x00100UL << ADC_AWD2CR_AWD2CH_Pos)    /*!< 0x00000100 */
#define ADC_AWD2CR_AWD2CH_9            (0x00200UL << ADC_AWD2CR_AWD2CH_Pos)    /*!< 0x00000200 */
#define ADC_AWD2CR_AWD2CH_10           (0x00400UL << ADC_AWD2CR_AWD2CH_Pos)    /*!< 0x00000400 */
#define ADC_AWD2CR_AWD2CH_11           (0x00800UL << ADC_AWD2CR_AWD2CH_Pos)    /*!< 0x00000800 */
#define ADC_AWD2CR_AWD2CH_12           (0x01000UL << ADC_AWD2CR_AWD2CH_Pos)    /*!< 0x00001000 */
#define ADC_AWD2CR_AWD2CH_13           (0x02000UL << ADC_AWD2CR_AWD2CH_Pos)    /*!< 0x00002000 */
#define ADC_AWD2CR_AWD2CH_14           (0x04000UL << ADC_AWD2CR_AWD2CH_Pos)    /*!< 0x00004000 */
#define ADC_AWD2CR_AWD2CH_15           (0x08000UL << ADC_AWD2CR_AWD2CH_Pos)    /*!< 0x00008000 */
#define ADC_AWD2CR_AWD2CH_16           (0x10000UL << ADC_AWD2CR_AWD2CH_Pos)    /*!< 0x00010000 */
#define ADC_AWD2CR_AWD2CH_17           (0x20000UL << ADC_AWD2CR_AWD2CH_Pos)    /*!< 0x00020000 */
#define ADC_AWD2CR_AWD2CH_18           (0x40000UL << ADC_AWD2CR_AWD2CH_Pos)    /*!< 0x00040000 */

/********************  Bit definition for ADC_AWD3CR register  ****************/
#define ADC_AWD3CR_AWD3CH_Pos          (0U)
#define ADC_AWD3CR_AWD3CH_Msk          (0x7FFFFUL << ADC_AWD3CR_AWD3CH_Pos)    /*!< 0x0007FFFF */
#define ADC_AWD3CR_AWD3CH              ADC_AWD3CR_AWD3CH_Msk                   /*!< ADC analog watchdog 3 monitored channel selection */
#define ADC_AWD3CR_AWD3CH_0            (0x00001UL << ADC_AWD3CR_AWD3CH_Pos)    /*!< 0x00000001 */
#define ADC_AWD3CR_AWD3CH_1            (0x00002UL << ADC_AWD3CR_AWD3CH_Pos)    /*!< 0x00000002 */
#define ADC_AWD3CR_AWD3CH_2            (0x00004UL << ADC_AWD3CR_AWD3CH_Pos)    /*!< 0x00000004 */
#define ADC_AWD3CR_AWD3CH_3            (0x00008UL << ADC_AWD3CR_AWD3CH_Pos)    /*!< 0x00000008 */
#define ADC_AWD3CR_AWD3CH_4            (0x00010UL << ADC_AWD3CR_AWD3CH_Pos)    /*!< 0x00000010 */
#define ADC_AWD3CR_AWD3CH_5            (0x00020UL << ADC_AWD3CR_AWD3CH_Pos)    /*!< 0x00000020 */
#define ADC_AWD3CR_AWD3CH_6            (0x00040UL << ADC_AWD3CR_AWD3CH_Pos)    /*!< 0x00000040 */
#define ADC_AWD3CR_AWD3CH_7            (0x00080UL << ADC_AWD3CR_AWD3CH_Pos)    /*!< 0x00000080 */
#define ADC_AWD3CR_AWD3CH_8            (0x00100UL << ADC_AWD3CR_AWD3CH_Pos)    /*!< 0x00000100 */
#define ADC_AWD3CR_AWD3CH_9            (0x00200UL << ADC_AWD3CR_AWD3CH_Pos)    /*!< 0x00000200 */
#define ADC_AWD3CR_AWD3CH_10           (0x00400UL << ADC_AWD3CR_AWD3CH_Pos)    /*!< 0x00000400 */
#define ADC_AWD3CR_AWD3CH_11           (0x00800UL << ADC_AWD3CR_AWD3CH_Pos)    /*!< 0x00000800 */
#define ADC_AWD3CR_AWD3CH_12           (0x01000UL << ADC_AWD3CR_AWD3CH_Pos)    /*!< 0x00001000 */
#define ADC_AWD3CR_AWD3CH_13           (0x02000UL << ADC_AWD3CR_AWD3CH_Pos)    /*!< 0x00002000 */
#define ADC_AWD3CR_AWD3CH_14           (0x04000UL << ADC_AWD3CR_AWD3CH_Pos)    /*!< 0x00004000 */
#define ADC_AWD3CR_AWD3CH_15           (0x08000UL << ADC_AWD3CR_AWD3CH_Pos)    /*!< 0x00008000 */
#define ADC_AWD3CR_AWD3CH_16           (0x10000UL << ADC_AWD3CR_AWD3CH_Pos)    /*!< 0x00010000 */
#define ADC_AWD3CR_AWD3CH_17           (0x20000UL << ADC_AWD3CR_AWD3CH_Pos)    /*!< 0x00020000 */
#define ADC_AWD3CR_AWD3CH_18           (0x40000UL << ADC_AWD3CR_AWD3CH_Pos)    /*!< 0x00040000 */

#endif
/********************  Bit definition for ADC_CALFACT register  ***************/
#define ADC_CALFACT_CALFACT_Pos        (0U)
#define ADC_CALFACT_CALFACT_Msk        (0x7FUL << ADC_CALFACT_CALFACT_Pos)     /*!< 0x0000007F */
#define ADC_CALFACT_CALFACT            ADC_CALFACT_CALFACT_Msk                 /*!< ADC calibration factor in single-ended mode */
#define ADC_CALFACT_CALFACT_0          (0x01UL << ADC_CALFACT_CALFACT_Pos)     /*!< 0x00000001 */
#define ADC_CALFACT_CALFACT_1          (0x02UL << ADC_CALFACT_CALFACT_Pos)     /*!< 0x00000002 */
#define ADC_CALFACT_CALFACT_2          (0x04UL << ADC_CALFACT_CALFACT_Pos)     /*!< 0x00000004 */
#define ADC_CALFACT_CALFACT_3          (0x08UL << ADC_CALFACT_CALFACT_Pos)     /*!< 0x00000008 */
#define ADC_CALFACT_CALFACT_4          (0x10UL << ADC_CALFACT_CALFACT_Pos)     /*!< 0x00000010 */
#define ADC_CALFACT_CALFACT_5          (0x20UL << ADC_CALFACT_CALFACT_Pos)     /*!< 0x00000020 */
#define ADC_CALFACT_CALFACT_6          (0x40UL << ADC_CALFACT_CALFACT_Pos)     /*!< 0x00000040 */

/*************************  ADC Common registers  *****************************/
/********************  Bit definition for ADC_CCR register  *******************/
#define ADC_CCR_PRESC_Pos              (18U)
#define ADC_CCR_PRESC_Msk              (0xFUL << ADC_CCR_PRESC_Pos)            /*!< 0x003C0000 */
#define ADC_CCR_PRESC                  ADC_CCR_PRESC_Msk                       /*!< ADC common clock prescaler, only for clock source asynchronous */
#define ADC_CCR_PRESC_0                (0x1UL << ADC_CCR_PRESC_Pos)            /*!< 0x00040000 */
#define ADC_CCR_PRESC_1                (0x2UL << ADC_CCR_PRESC_Pos)            /*!< 0x00080000 */
#define ADC_CCR_PRESC_2                (0x4UL << ADC_CCR_PRESC_Pos)            /*!< 0x00100000 */
#define ADC_CCR_PRESC_3                (0x8UL << ADC_CCR_PRESC_Pos)            /*!< 0x00200000 */

#define ADC_CCR_VREFEN_Pos             (22U)
#define ADC_CCR_VREFEN_Msk             (0x1UL << ADC_CCR_VREFEN_Pos)           /*!< 0x00400000 */
#define ADC_CCR_VREFEN                 ADC_CCR_VREFEN_Msk                      /*!< ADC internal path to VrefInt enable */
#define ADC_CCR_TSEN_Pos               (23U)
#define ADC_CCR_TSEN_Msk               (0x1UL << ADC_CCR_TSEN_Pos)             /*!< 0x00800000 */
#define ADC_CCR_TSEN                   ADC_CCR_TSEN_Msk                        /*!< ADC internal path to temperature sensor enable */
#define ADC_CCR_VBATEN_Pos             (24U)
#define ADC_CCR_VBATEN_Msk             (0x1UL << ADC_CCR_VBATEN_Pos)           /*!< 0x01000000 */
#define ADC_CCR_VBATEN                 ADC_CCR_VBATEN_Msk                      /*!< ADC internal path to battery voltage enable */
#else

#define ADC_SUPPORT_5_MSPS   /* ADC sampling rate 5 Msamples/sec */

/********************  Bit definition for ADC_ISR register  *******************/
#define ADC_ISR_ADRDY_Pos            (0U)
#define ADC_ISR_ADRDY_Msk            (0x1UL << ADC_ISR_ADRDY_Pos)              /*!< 0x00000001 */
#define ADC_ISR_ADRDY                ADC_ISR_ADRDY_Msk                         /*!< ADC ready flag */
#define ADC_ISR_EOSMP_Pos            (1U)
#define ADC_ISR_EOSMP_Msk            (0x1UL << ADC_ISR_EOSMP_Pos)              /*!< 0x00000002 */
#define ADC_ISR_EOSMP                ADC_ISR_EOSMP_Msk                         /*!< ADC group regular end of sampling flag */
#define ADC_ISR_EOC_Pos              (2U)
#define ADC_ISR_EOC_Msk              (0x1UL << ADC_ISR_EOC_Pos)                /*!< 0x00000004 */
#define ADC_ISR_EOC                  ADC_ISR_EOC_Msk                           /*!< ADC group regular end of unitary conversion flag */
#define ADC_ISR_EOS_Pos              (3U)
#define ADC_ISR_EOS_Msk              (0x1UL << ADC_ISR_EOS_Pos)                /*!< 0x00000008 */
#define ADC_ISR_EOS                  ADC_ISR_EOS_Msk                           /*!< ADC group regular end of sequence conversions flag */
#define ADC_ISR_OVR_Pos              (4U)
#define ADC_ISR_OVR_Msk              (0x1UL << ADC_ISR_OVR_Pos)                /*!< 0x00000010 */
#define ADC_ISR_OVR                  ADC_ISR_OVR_Msk                           /*!< ADC group regular overrun flag */
#define ADC_ISR_JEOC_Pos             (5U)
#define ADC_ISR_JEOC_Msk             (0x1UL << ADC_ISR_JEOC_Pos)               /*!< 0x00000020 */
#define ADC_ISR_JEOC                 ADC_ISR_JEOC_Msk                          /*!< ADC group injected end of unitary conversion flag */
#define ADC_ISR_JEOS_Pos             (6U)
#define ADC_ISR_JEOS_Msk             (0x1UL << ADC_ISR_JEOS_Pos)               /*!< 0x00000040 */
#define ADC_ISR_JEOS                 ADC_ISR_JEOS_Msk                          /*!< ADC group injected end of sequence conversions flag */
#define ADC_ISR_AWD1_Pos             (7U)
#define ADC_ISR_AWD1_Msk             (0x1UL << ADC_ISR_AWD1_Pos)               /*!< 0x00000080 */
#define ADC_ISR_AWD1                 ADC_ISR_AWD1_Msk                          /*!< ADC analog watchdog 1 flag */
#define ADC_ISR_AWD2_Pos             (8U)
#define ADC_ISR_AWD2_Msk             (0x1UL << ADC_ISR_AWD2_Pos)               /*!< 0x00000100 */
#define ADC_ISR_AWD2                 ADC_ISR_AWD2_Msk                          /*!< ADC analog watchdog 2 flag */
#define ADC_ISR_AWD3_Pos             (9U)
#define ADC_ISR_AWD3_Msk             (0x1UL << ADC_ISR_AWD3_Pos)               /*!< 0x00000200 */
#define ADC_ISR_AWD3                 ADC_ISR_AWD3_Msk                          /*!< ADC analog watchdog 3 flag */
#define ADC_ISR_JQOVF_Pos            (10U)
#define ADC_ISR_JQOVF_Msk            (0x1UL << ADC_ISR_JQOVF_Pos)              /*!< 0x00000400 */
#define ADC_ISR_JQOVF                ADC_ISR_JQOVF_Msk                         /*!< ADC group injected contexts queue overflow flag */

/********************  Bit definition for ADC_IER register  *******************/
#define ADC_IER_ADRDYIE_Pos          (0U)
#define ADC_IER_ADRDYIE_Msk          (0x1UL << ADC_IER_ADRDYIE_Pos)            /*!< 0x00000001 */
#define ADC_IER_ADRDYIE              ADC_IER_ADRDYIE_Msk                       /*!< ADC ready interrupt */
#define ADC_IER_EOSMPIE_Pos          (1U)
#define ADC_IER_EOSMPIE_Msk          (0x1UL << ADC_IER_EOSMPIE_Pos)            /*!< 0x00000002 */
#define ADC_IER_EOSMPIE              ADC_IER_EOSMPIE_Msk                       /*!< ADC group regular end of sampling interrupt */
#define ADC_IER_EOCIE_Pos            (2U)
#define ADC_IER_EOCIE_Msk            (0x1UL << ADC_IER_EOCIE_Pos)              /*!< 0x00000004 */
#define ADC_IER_EOCIE                ADC_IER_EOCIE_Msk                         /*!< ADC group regular end of unitary conversion interrupt */
#define ADC_IER_EOSIE_Pos            (3U)
#define ADC_IER_EOSIE_Msk            (0x1UL << ADC_IER_EOSIE_Pos)              /*!< 0x00000008 */
#define ADC_IER_EOSIE                ADC_IER_EOSIE_Msk                         /*!< ADC group regular end of sequence conversions interrupt */
#define ADC_IER_OVRIE_Pos            (4U)
#define ADC_IER_OVRIE_Msk            (0x1UL << ADC_IER_OVRIE_Pos)              /*!< 0x00000010 */
#define ADC_IER_OVRIE                ADC_IER_OVRIE_Msk                         /*!< ADC group regular overrun interrupt */
#define ADC_IER_JEOCIE_Pos           (5U)
#define ADC_IER_JEOCIE_Msk           (0x1UL << ADC_IER_JEOCIE_Pos)             /*!< 0x00000020 */
#define ADC_IER_JEOCIE               ADC_IER_JEOCIE_Msk                        /*!< ADC group injected end of unitary conversion interrupt */
#define ADC_IER_JEOSIE_Pos           (6U)
#define ADC_IER_JEOSIE_Msk           (0x1UL << ADC_IER_JEOSIE_Pos)             /*!< 0x00000040 */
#define ADC_IER_JEOSIE               ADC_IER_JEOSIE_Msk                        /*!< ADC group injected end of sequence conversions interrupt */
#define ADC_IER_AWD1IE_Pos           (7U)
#define ADC_IER_AWD1IE_Msk           (0x1UL << ADC_IER_AWD1IE_Pos)             /*!< 0x00000080 */
#define ADC_IER_AWD1IE               ADC_IER_AWD1IE_Msk                        /*!< ADC analog watchdog 1 interrupt */
#define ADC_IER_AWD2IE_Pos           (8U)
#define ADC_IER_AWD2IE_Msk           (0x1UL << ADC_IER_AWD2IE_Pos)             /*!< 0x00000100 */
#define ADC_IER_AWD2IE               ADC_IER_AWD2IE_Msk                        /*!< ADC analog watchdog 2 interrupt */
#define ADC_IER_AWD3IE_Pos           (9U)
#define ADC_IER_AWD3IE_Msk           (0x1UL << ADC_IER_AWD3IE_Pos)             /*!< 0x00000200 */
#define ADC_IER_AWD3IE               ADC_IER_AWD3IE_Msk                        /*!< ADC analog watchdog 3 interrupt */
#define ADC_IER_JQOVFIE_Pos          (10U)
#define ADC_IER_JQOVFIE_Msk          (0x1UL << ADC_IER_JQOVFIE_Pos)            /*!< 0x00000400 */
#define ADC_IER_JQOVFIE              ADC_IER_JQOVFIE_Msk                       /*!< ADC group injected contexts queue overflow interrupt */

/********************  Bit definition for ADC_CR register  ********************/
#define ADC_CR_ADEN_Pos              (0U)
#define ADC_CR_ADEN_Msk              (0x1UL << ADC_CR_ADEN_Pos)                /*!< 0x00000001 */
#define ADC_CR_ADEN                  ADC_CR_ADEN_Msk                           /*!< ADC enable */
#define ADC_CR_ADDIS_Pos             (1U)
#define ADC_CR_ADDIS_Msk             (0x1UL << ADC_CR_ADDIS_Pos)               /*!< 0x00000002 */
#define ADC_CR_ADDIS                 ADC_CR_ADDIS_Msk                          /*!< ADC disable */
#define ADC_CR_ADSTART_Pos           (2U)
#define ADC_CR_ADSTART_Msk           (0x1UL << ADC_CR_ADSTART_Pos)             /*!< 0x00000004 */
#define ADC_CR_ADSTART               ADC_CR_ADSTART_Msk                        /*!< ADC group regular conversion start */
#define ADC_CR_JADSTART_Pos          (3U)
#define ADC_CR_JADSTART_Msk          (0x1UL << ADC_CR_JADSTART_Pos)            /*!< 0x00000008 */
#define ADC_CR_JADSTART              ADC_CR_JADSTART_Msk                       /*!< ADC group injected conversion start */
#define ADC_CR_ADSTP_Pos             (4U)
#define ADC_CR_ADSTP_Msk             (0x1UL << ADC_CR_ADSTP_Pos)               /*!< 0x00000010 */
#define ADC_CR_ADSTP                 ADC_CR_ADSTP_Msk                          /*!< ADC group regular conversion stop */
#define ADC_CR_JADSTP_Pos            (5U)
#define ADC_CR_JADSTP_Msk            (0x1UL << ADC_CR_JADSTP_Pos)              /*!< 0x00000020 */
#define ADC_CR_JADSTP                ADC_CR_JADSTP_Msk                         /*!< ADC group injected conversion stop */
#define ADC_CR_ADVREGEN_Pos          (28U)
#define ADC_CR_ADVREGEN_Msk          (0x1UL << ADC_CR_ADVREGEN_Pos)            /*!< 0x10000000 */
#define ADC_CR_ADVREGEN              ADC_CR_ADVREGEN_Msk                       /*!< ADC voltage regulator enable */
#define ADC_CR_DEEPPWD_Pos           (29U)
#define ADC_CR_DEEPPWD_Msk           (0x1UL << ADC_CR_DEEPPWD_Pos)             /*!< 0x20000000 */
#define ADC_CR_DEEPPWD               ADC_CR_DEEPPWD_Msk                        /*!< ADC deep power down enable */
#define ADC_CR_ADCALDIF_Pos          (30U)
#define ADC_CR_ADCALDIF_Msk          (0x1UL << ADC_CR_ADCALDIF_Pos)            /*!< 0x40000000 */
#define ADC_CR_ADCALDIF              ADC_CR_ADCALDIF_Msk                       /*!< ADC differential mode for calibration */
#define ADC_CR_ADCAL_Pos             (31U)
#define ADC_CR_ADCAL_Msk             (0x1UL << ADC_CR_ADCAL_Pos)               /*!< 0x80000000 */
#define ADC_CR_ADCAL                 ADC_CR_ADCAL_Msk                          /*!< ADC calibration */

