STMicroelectronics/x-cube-memsmic1/Drivers/CMSIS/Device/ST/STM32WBxx/Include/stm32WBxxxxx.h
/********************  Bit definition for PWR_PUCRC register  *****************/
#if defined (STM32WB55xx) || defined (STM32WB35xx) || defined(STM32WB5Mxx)
#define PWR_PUCRC_PC0_Pos              (0U)
#define PWR_PUCRC_PC0_Msk              (0x1UL << PWR_PUCRC_PC0_Pos)            /*!< 0x00000001 */
#define PWR_PUCRC_PC0                  PWR_PUCRC_PC0_Msk                       /*!< Pin PC0 Pull-Up set */
#define PWR_PUCRC_PC1_Pos              (1U)
#define PWR_PUCRC_PC1_Msk              (0x1UL << PWR_PUCRC_PC1_Pos)            /*!< 0x00000002 */
#define PWR_PUCRC_PC1                  PWR_PUCRC_PC1_Msk                       /*!< Pin PC1 Pull-Up set */
#define PWR_PUCRC_PC2_Pos              (2U)
#define PWR_PUCRC_PC2_Msk              (0x1UL << PWR_PUCRC_PC2_Pos)            /*!< 0x00000004 */
#define PWR_PUCRC_PC2                  PWR_PUCRC_PC2_Msk                       /*!< Pin PC2 Pull-Up set */
#define PWR_PUCRC_PC3_Pos              (3U)
#define PWR_PUCRC_PC3_Msk              (0x1UL << PWR_PUCRC_PC3_Pos)            /*!< 0x00000008 */
#define PWR_PUCRC_PC3                  PWR_PUCRC_PC3_Msk                       /*!< Pin PC3 Pull-Up set */
#define PWR_PUCRC_PC4_Pos              (4U)
#define PWR_PUCRC_PC4_Msk              (0x1UL << PWR_PUCRC_PC4_Pos)            /*!< 0x00000010 */
#define PWR_PUCRC_PC4                  PWR_PUCRC_PC4_Msk                       /*!< Pin PC4 Pull-Up set */
#define PWR_PUCRC_PC5_Pos              (5U)
#define PWR_PUCRC_PC5_Msk              (0x1UL << PWR_PUCRC_PC5_Pos)            /*!< 0x00000020 */
#define PWR_PUCRC_PC5                  PWR_PUCRC_PC5_Msk                       /*!< Pin PC5 Pull-Up set */
#define PWR_PUCRC_PC6_Pos              (6U)
#define PWR_PUCRC_PC6_Msk              (0x1UL << PWR_PUCRC_PC6_Pos)            /*!< 0x00000040 */
#define PWR_PUCRC_PC6                  PWR_PUCRC_PC6_Msk                       /*!< Pin PC6 Pull-Up set */
#define PWR_PUCRC_PC7_Pos              (7U)
#define PWR_PUCRC_PC7_Msk              (0x1UL << PWR_PUCRC_PC7_Pos)            /*!< 0x00000080 */
#define PWR_PUCRC_PC7                  PWR_PUCRC_PC7_Msk                       /*!< Pin PC7 Pull-Up set */
#define PWR_PUCRC_PC8_Pos              (8U)
#define PWR_PUCRC_PC8_Msk              (0x1UL << PWR_PUCRC_PC8_Pos)            /*!< 0x00000100 */
#define PWR_PUCRC_PC8                  PWR_PUCRC_PC8_Msk                       /*!< Pin PC8 Pull-Up set */
#define PWR_PUCRC_PC9_Pos              (9U)
#define PWR_PUCRC_PC9_Msk              (0x1UL << PWR_PUCRC_PC9_Pos)            /*!< 0x00000200 */
#define PWR_PUCRC_PC9                  PWR_PUCRC_PC9_Msk                       /*!< Pin PC9 Pull-Up set */
#define PWR_PUCRC_PC10_Pos             (10U)
#define PWR_PUCRC_PC10_Msk             (0x1UL << PWR_PUCRC_PC10_Pos)           /*!< 0x00000400 */
#define PWR_PUCRC_PC10                 PWR_PUCRC_PC10_Msk                      /*!< Pin PC10 Pull-Up set */
#define PWR_PUCRC_PC11_Pos             (11U)
#define PWR_PUCRC_PC11_Msk             (0x1UL << PWR_PUCRC_PC11_Pos)           /*!< 0x00000800 */
#define PWR_PUCRC_PC11                 PWR_PUCRC_PC11_Msk                      /*!< Pin PC11 Pull-Up set */
#define PWR_PUCRC_PC12_Pos             (12U)
#define PWR_PUCRC_PC12_Msk             (0x1UL << PWR_PUCRC_PC12_Pos)           /*!< 0x00001000 */
#define PWR_PUCRC_PC12                 PWR_PUCRC_PC12_Msk                      /*!< Pin PC12 Pull-Up set */
#define PWR_PUCRC_PC13_Pos             (13U)
#define PWR_PUCRC_PC13_Msk             (0x1UL << PWR_PUCRC_PC13_Pos)           /*!< 0x00002000 */
#define PWR_PUCRC_PC13                 PWR_PUCRC_PC13_Msk                      /*!< Pin PC13 Pull-Up set */
#endif
#define PWR_PUCRC_PC14_Pos             (14U)
#define PWR_PUCRC_PC14_Msk             (0x1UL << PWR_PUCRC_PC14_Pos)           /*!< 0x00004000 */
#define PWR_PUCRC_PC14                 PWR_PUCRC_PC14_Msk                      /*!< Pin PC14 Pull-Up set */
#define PWR_PUCRC_PC15_Pos             (15U)
#define PWR_PUCRC_PC15_Msk             (0x1UL << PWR_PUCRC_PC15_Pos)           /*!< 0x00008000 */
#define PWR_PUCRC_PC15                 PWR_PUCRC_PC15_Msk                      /*!< Pin PC15 Pull-Up set */

/********************  Bit definition for PWR_PDCRC register  *****************/
#if defined (STM32WB55xx) || defined (STM32WB35xx) || defined(STM32WB5Mxx)
#define PWR_PDCRC_PC0_Pos              (0U)
#define PWR_PDCRC_PC0_Msk              (0x1UL << PWR_PDCRC_PC0_Pos)            /*!< 0x00000001 */
#define PWR_PDCRC_PC0                  PWR_PDCRC_PC0_Msk                       /*!< Pin PC0 Pull-Down set */
#define PWR_PDCRC_PC1_Pos              (1U)
#define PWR_PDCRC_PC1_Msk              (0x1UL << PWR_PDCRC_PC1_Pos)            /*!< 0x00000002 */
#define PWR_PDCRC_PC1                  PWR_PDCRC_PC1_Msk                       /*!< Pin PC1 Pull-Down set */
#define PWR_PDCRC_PC2_Pos              (2U)
#define PWR_PDCRC_PC2_Msk              (0x1UL << PWR_PDCRC_PC2_Pos)            /*!< 0x00000004 */
#define PWR_PDCRC_PC2                  PWR_PDCRC_PC2_Msk                       /*!< Pin PC2 Pull-Down set */
#define PWR_PDCRC_PC3_Pos              (3U)
#define PWR_PDCRC_PC3_Msk              (0x1UL << PWR_PDCRC_PC3_Pos)            /*!< 0x00000008 */
#define PWR_PDCRC_PC3                  PWR_PDCRC_PC3_Msk                       /*!< Pin PC3 Pull-Down set */
#define PWR_PDCRC_PC4_Pos              (4U)
#define PWR_PDCRC_PC4_Msk              (0x1UL << PWR_PDCRC_PC4_Pos)            /*!< 0x00000010 */
#define PWR_PDCRC_PC4                  PWR_PDCRC_PC4_Msk                       /*!< Pin PC4 Pull-Down set */
#define PWR_PDCRC_PC5_Pos              (5U)
#define PWR_PDCRC_PC5_Msk              (0x1UL << PWR_PDCRC_PC5_Pos)            /*!< 0x00000020 */
#define PWR_PDCRC_PC5                  PWR_PDCRC_PC5_Msk                       /*!< Pin PC5 Pull-Down set */
#define PWR_PDCRC_PC6_Pos              (6U)
#define PWR_PDCRC_PC6_Msk              (0x1UL << PWR_PDCRC_PC6_Pos)            /*!< 0x00000040 */
#define PWR_PDCRC_PC6                  PWR_PDCRC_PC6_Msk                       /*!< Pin PC6 Pull-Down set */
#define PWR_PDCRC_PC7_Pos              (7U)
#define PWR_PDCRC_PC7_Msk              (0x1UL << PWR_PDCRC_PC7_Pos)            /*!< 0x00000080 */
#define PWR_PDCRC_PC7                  PWR_PDCRC_PC7_Msk                       /*!< Pin PC7 Pull-Down set */
#define PWR_PDCRC_PC8_Pos              (8U)
#define PWR_PDCRC_PC8_Msk              (0x1UL << PWR_PDCRC_PC8_Pos)            /*!< 0x00000100 */
#define PWR_PDCRC_PC8                  PWR_PDCRC_PC8_Msk                       /*!< Pin PC8 Pull-Down set */
#define PWR_PDCRC_PC9_Pos              (9U)
#define PWR_PDCRC_PC9_Msk              (0x1UL << PWR_PDCRC_PC9_Pos)            /*!< 0x00000200 */
#define PWR_PDCRC_PC9                  PWR_PDCRC_PC9_Msk                       /*!< Pin PC9 Pull-Down set */
#define PWR_PDCRC_PC10_Pos             (10U)
#define PWR_PDCRC_PC10_Msk             (0x1UL << PWR_PDCRC_PC10_Pos)           /*!< 0x00000400 */
#define PWR_PDCRC_PC10                 PWR_PDCRC_PC10_Msk                      /*!< Pin PC10 Pull-Down set */
#define PWR_PDCRC_PC11_Pos             (11U)
#define PWR_PDCRC_PC11_Msk             (0x1UL << PWR_PDCRC_PC11_Pos)           /*!< 0x00000800 */
#define PWR_PDCRC_PC11                 PWR_PDCRC_PC11_Msk                      /*!< Pin PC11 Pull-Down set */
#define PWR_PDCRC_PC12_Pos             (12U)
#define PWR_PDCRC_PC12_Msk             (0x1UL << PWR_PDCRC_PC12_Pos)           /*!< 0x00001000 */
#define PWR_PDCRC_PC12                 PWR_PDCRC_PC12_Msk                      /*!< Pin PC12 Pull-Down set */
#define PWR_PDCRC_PC13_Pos             (13U)
#define PWR_PDCRC_PC13_Msk             (0x1UL << PWR_PDCRC_PC13_Pos)           /*!< 0x00002000 */
#define PWR_PDCRC_PC13                 PWR_PDCRC_PC13_Msk                      /*!< Pin PC13 Pull-Down set */
#endif
#define PWR_PDCRC_PC14_Pos             (14U)
#define PWR_PDCRC_PC14_Msk             (0x1UL << PWR_PDCRC_PC14_Pos)           /*!< 0x00004000 */
#define PWR_PDCRC_PC14                 PWR_PDCRC_PC14_Msk                      /*!< Pin PC14 Pull-Down set */
#define PWR_PDCRC_PC15_Pos             (15U)
#define PWR_PDCRC_PC15_Msk             (0x1UL << PWR_PDCRC_PC15_Pos)           /*!< 0x00008000 */
#define PWR_PDCRC_PC15                 PWR_PDCRC_PC15_Msk                      /*!< Pin PC15 Pull-Down set */

#if defined (STM32WB55xx) || defined(STM32WB5Mxx)
/********************  Bit definition for PWR_PUCRD register  *****************/
#define PWR_PUCRD_PD0_Pos              (0U)
#define PWR_PUCRD_PD0_Msk              (0x1UL << PWR_PUCRD_PD0_Pos)            /*!< 0x00000001 */
#define PWR_PUCRD_PD0                  PWR_PUCRD_PD0_Msk                       /*!< Pin PD0 Pull-Up set */
#define PWR_PUCRD_PD1_Pos              (1U)
#define PWR_PUCRD_PD1_Msk              (0x1UL << PWR_PUCRD_PD1_Pos)            /*!< 0x00000002 */
#define PWR_PUCRD_PD1                  PWR_PUCRD_PD1_Msk                       /*!< Pin PD1 Pull-Up set */
#define PWR_PUCRD_PD2_Pos              (2U)
#define PWR_PUCRD_PD2_Msk              (0x1UL << PWR_PUCRD_PD2_Pos)            /*!< 0x00000004 */
#define PWR_PUCRD_PD2                  PWR_PUCRD_PD2_Msk                       /*!< Pin PD2 Pull-Up set */
#define PWR_PUCRD_PD3_Pos              (3U)
#define PWR_PUCRD_PD3_Msk              (0x1UL << PWR_PUCRD_PD3_Pos)            /*!< 0x00000008 */
#define PWR_PUCRD_PD3                  PWR_PUCRD_PD3_Msk                       /*!< Pin PD3 Pull-Up set */
#define PWR_PUCRD_PD4_Pos              (4U)
#define PWR_PUCRD_PD4_Msk              (0x1UL << PWR_PUCRD_PD4_Pos)            /*!< 0x00000010 */
#define PWR_PUCRD_PD4                  PWR_PUCRD_PD4_Msk                       /*!< Pin PD4 Pull-Up set */
#define PWR_PUCRD_PD5_Pos              (5U)
#define PWR_PUCRD_PD5_Msk              (0x1UL << PWR_PUCRD_PD5_Pos)            /*!< 0x00000020 */
#define PWR_PUCRD_PD5                  PWR_PUCRD_PD5_Msk                       /*!< Pin PD5 Pull-Up set */
#define PWR_PUCRD_PD6_Pos              (6U)
#define PWR_PUCRD_PD6_Msk              (0x1UL << PWR_PUCRD_PD6_Pos)            /*!< 0x00000040 */
#define PWR_PUCRD_PD6                  PWR_PUCRD_PD6_Msk                       /*!< Pin PD6 Pull-Up set */
#define PWR_PUCRD_PD8_Pos              (8U)
#define PWR_PUCRD_PD8_Msk              (0x1UL << PWR_PUCRD_PD8_Pos)            /*!< 0x00000100 */
#define PWR_PUCRD_PD8                  PWR_PUCRD_PD8_Msk                       /*!< Pin PD8 Pull-Up set */
#define PWR_PUCRD_PD9_Pos              (9U)
#define PWR_PUCRD_PD9_Msk              (0x1UL << PWR_PUCRD_PD9_Pos)            /*!< 0x00000200 */
#define PWR_PUCRD_PD9                  PWR_PUCRD_PD9_Msk                       /*!< Pin PD9 Pull-Up set */
#define PWR_PUCRD_PD10_Pos             (10U)
#define PWR_PUCRD_PD10_Msk             (0x1UL << PWR_PUCRD_PD10_Pos)           /*!< 0x00000400 */
#define PWR_PUCRD_PD10                 PWR_PUCRD_PD10_Msk                      /*!< Pin PD10 Pull-Up set */
#define PWR_PUCRD_PD11_Pos             (11U)
#define PWR_PUCRD_PD11_Msk             (0x1UL << PWR_PUCRD_PD11_Pos)           /*!< 0x00000800 */
#define PWR_PUCRD_PD11                 PWR_PUCRD_PD11_Msk                      /*!< Pin PD11 Pull-Up set */
#define PWR_PUCRD_PD12_Pos             (12U)
#define PWR_PUCRD_PD12_Msk             (0x1UL << PWR_PUCRD_PD12_Pos)           /*!< 0x00001000 */
#define PWR_PUCRD_PD12                 PWR_PUCRD_PD12_Msk                      /*!< Pin PD12 Pull-Up set */
#define PWR_PUCRD_PD13_Pos             (13U)
#define PWR_PUCRD_PD13_Msk             (0x1UL << PWR_PUCRD_PD13_Pos)           /*!< 0x00002000 */
#define PWR_PUCRD_PD13                 PWR_PUCRD_PD13_Msk                      /*!< Pin PD13 Pull-Up set */
#define PWR_PUCRD_PD14_Pos             (14U)
#define PWR_PUCRD_PD14_Msk             (0x1UL << PWR_PUCRD_PD14_Pos)           /*!< 0x00004000 */
#define PWR_PUCRD_PD14                 PWR_PUCRD_PD14_Msk                      /*!< Pin PD14 Pull-Up set */
#define PWR_PUCRD_PD15_Pos             (15U)
#define PWR_PUCRD_PD15_Msk             (0x1UL << PWR_PUCRD_PD15_Pos)           /*!< 0x00008000 */
#define PWR_PUCRD_PD15                 PWR_PUCRD_PD15_Msk                      /*!< Pin PD15 Pull-Up set */

/********************  Bit definition for PWR_PDCRD register  *****************/
#define PWR_PDCRD_PD0_Pos              (0U)
#define PWR_PDCRD_PD0_Msk              (0x1UL << PWR_PDCRD_PD0_Pos)            /*!< 0x00000001 */
#define PWR_PDCRD_PD0                  PWR_PDCRD_PD0_Msk                       /*!< Pin PD0 Pull-Down set */
#define PWR_PDCRD_PD1_Pos              (1U)
#define PWR_PDCRD_PD1_Msk              (0x1UL << PWR_PDCRD_PD1_Pos)            /*!< 0x00000002 */
#define PWR_PDCRD_PD1                  PWR_PDCRD_PD1_Msk                       /*!< Pin PD1 Pull-Down set */
#define PWR_PDCRD_PD2_Pos              (2U)
#define PWR_PDCRD_PD2_Msk              (0x1UL << PWR_PDCRD_PD2_Pos)            /*!< 0x00000004 */
#define PWR_PDCRD_PD2                  PWR_PDCRD_PD2_Msk                       /*!< Pin PD2 Pull-Down set */
#define PWR_PDCRD_PD3_Pos              (3U)
#define PWR_PDCRD_PD3_Msk              (0x1UL << PWR_PDCRD_PD3_Pos)            /*!< 0x00000008 */
#define PWR_PDCRD_PD3                  PWR_PDCRD_PD3_Msk                       /*!< Pin PD3 Pull-Down set */
#define PWR_PDCRD_PD4_Pos              (4U)
#define PWR_PDCRD_PD4_Msk              (0x1UL << PWR_PDCRD_PD4_Pos)            /*!< 0x00000010 */
#define PWR_PDCRD_PD4                  PWR_PDCRD_PD4_Msk                       /*!< Pin PD4 Pull-Down set */
#define PWR_PDCRD_PD5_Pos              (5U)
#define PWR_PDCRD_PD5_Msk              (0x1UL << PWR_PDCRD_PD5_Pos)            /*!< 0x00000020 */
#define PWR_PDCRD_PD5                  PWR_PDCRD_PD5_Msk                       /*!< Pin PD5 Pull-Down set */
#define PWR_PDCRD_PD6_Pos              (6U)
#define PWR_PDCRD_PD6_Msk              (0x1UL << PWR_PDCRD_PD6_Pos)            /*!< 0x00000040 */
#define PWR_PDCRD_PD6                  PWR_PDCRD_PD6_Msk                       /*!< Pin PD6 Pull-Down set */
#define PWR_PDCRD_PD8_Pos              (8U)
#define PWR_PDCRD_PD8_Msk              (0x1UL << PWR_PDCRD_PD8_Pos)            /*!< 0x00000100 */
#define PWR_PDCRD_PD8                  PWR_PDCRD_PD8_Msk                       /*!< Pin PD8 Pull-Down set */
#define PWR_PDCRD_PD9_Pos              (9U)
#define PWR_PDCRD_PD9_Msk              (0x1UL << PWR_PDCRD_PD9_Pos)            /*!< 0x00000200 */
#define PWR_PDCRD_PD9                  PWR_PDCRD_PD9_Msk                       /*!< Pin PD9 Pull-Down set */
#define PWR_PDCRD_PD10_Pos             (10U)
#define PWR_PDCRD_PD10_Msk             (0x1UL << PWR_PDCRD_PD10_Pos)           /*!< 0x00000400 */
#define PWR_PDCRD_PD10                 PWR_PDCRD_PD10_Msk                      /*!< Pin PD10 Pull-Down set */
#define PWR_PDCRD_PD11_Pos             (11U)
#define PWR_PDCRD_PD11_Msk             (0x1UL << PWR_PDCRD_PD11_Pos)           /*!< 0x00000800 */
#define PWR_PDCRD_PD11                 PWR_PDCRD_PD11_Msk                      /*!< Pin PD11 Pull-Down set */
#define PWR_PDCRD_PD12_Pos             (12U)
#define PWR_PDCRD_PD12_Msk             (0x1UL << PWR_PDCRD_PD12_Pos)           /*!< 0x00001000 */
#define PWR_PDCRD_PD12                 PWR_PDCRD_PD12_Msk                      /*!< Pin PD12 Pull-Down set */
#define PWR_PDCRD_PD13_Pos             (13U)
#define PWR_PDCRD_PD13_Msk             (0x1UL << PWR_PDCRD_PD13_Pos)           /*!< 0x00002000 */
#define PWR_PDCRD_PD13                 PWR_PDCRD_PD13_Msk                      /*!< Pin PD13 Pull-Down set */
#define PWR_PDCRD_PD14_Pos             (14U)
#define PWR_PDCRD_PD14_Msk             (0x1UL << PWR_PDCRD_PD14_Pos)           /*!< 0x00004000 */
#define PWR_PDCRD_PD14                 PWR_PDCRD_PD14_Msk                      /*!< Pin PD14 Pull-Down set */
#define PWR_PDCRD_PD15_Pos             (15U)
#define PWR_PDCRD_PD15_Msk             (0x1UL << PWR_PDCRD_PD15_Pos)           /*!< 0x00008000 */
#define PWR_PDCRD_PD15                 PWR_PDCRD_PD15_Msk                      /*!< Pin PD15 Pull-Down set */

#endif
/********************  Bit definition for PWR_PUCRE register  *****************/
#if defined (STM32WB55xx) || defined (STM32WB35xx) || defined(STM32WB5Mxx)
#define PWR_PUCRE_PE0_Pos              (0U)
#define PWR_PUCRE_PE0_Msk              (0x1UL << PWR_PUCRE_PE0_Pos)            /*!< 0x00000001 */
#define PWR_PUCRE_PE0                  PWR_PUCRE_PE0_Msk                       /*!< Pin PE0 Pull-Up set */
#define PWR_PUCRE_PE1_Pos              (1U)
#define PWR_PUCRE_PE1_Msk              (0x1UL << PWR_PUCRE_PE1_Pos)            /*!< 0x00000002 */
#define PWR_PUCRE_PE1                  PWR_PUCRE_PE1_Msk                       /*!< Pin PE1 Pull-Up set */
#define PWR_PUCRE_PE2_Pos              (2U)
#define PWR_PUCRE_PE2_Msk              (0x1UL << PWR_PUCRE_PE2_Pos)            /*!< 0x00000004 */
#define PWR_PUCRE_PE2                  PWR_PUCRE_PE2_Msk                       /*!< Pin PE2 Pull-Up set */
#define PWR_PUCRE_PE3_Pos              (3U)
#define PWR_PUCRE_PE3_Msk              (0x1UL << PWR_PUCRE_PE3_Pos)            /*!< 0x00000008 */
#define PWR_PUCRE_PE3                  PWR_PUCRE_PE3_Msk                       /*!< Pin PE3 Pull-Up set */
#endif
#define PWR_PUCRE_PE4_Pos              (4U)
#define PWR_PUCRE_PE4_Msk              (0x1UL << PWR_PUCRE_PE4_Pos)            /*!< 0x00000010 */
#define PWR_PUCRE_PE4                  PWR_PUCRE_PE4_Msk                       /*!< Pin PE4 Pull-Up set */

/********************  Bit definition for PWR_PDCRE register  *****************/
#if defined (STM32WB55xx) || defined (STM32WB35xx) || defined(STM32WB5Mxx)
#define PWR_PDCRE_PE0_Pos              (0U)
#define PWR_PDCRE_PE0_Msk              (0x1UL << PWR_PDCRE_PE0_Pos)            /*!< 0x00000001 */
#define PWR_PDCRE_PE0                  PWR_PDCRE_PE0_Msk                       /*!< Pin PE0 Pull-Down set */
#define PWR_PDCRE_PE1_Pos              (1U)
#define PWR_PDCRE_PE1_Msk              (0x1UL << PWR_PDCRE_PE1_Pos)            /*!< 0x00000002 */
#define PWR_PDCRE_PE1                  PWR_PDCRE_PE1_Msk                       /*!< Pin PE1 Pull-Down set */
#define PWR_PDCRE_PE2_Pos              (2U)
#define PWR_PDCRE_PE2_Msk              (0x1UL << PWR_PDCRE_PE2_Pos)            /*!< 0x00000004 */
#define PWR_PDCRE_PE2                  PWR_PDCRE_PE2_Msk                       /*!< Pin PE2 Pull-Down set */
#define PWR_PDCRE_PE3_Pos              (3U)
#define PWR_PDCRE_PE3_Msk              (0x1UL << PWR_PDCRE_PE3_Pos)            /*!< 0x00000008 */
#define PWR_PDCRE_PE3                  PWR_PDCRE_PE3_Msk                       /*!< Pin PE3 Pull-Down set */
#endif
#define PWR_PDCRE_PE4_Pos              (4U)
#define PWR_PDCRE_PE4_Msk              (0x1UL << PWR_PDCRE_PE4_Pos)            /*!< 0x00000010 */
#define PWR_PDCRE_PE4                  PWR_PDCRE_PE4_Msk                       /*!< Pin PE4 Pull-Down set */

/********************  Bit definition for PWR_PUCRH register  *****************/
#if defined (STM32WB55xx) || defined (STM32WB35xx) || defined(STM32WB5Mxx)
#define PWR_PUCRH_PH0_Pos              (0U)
#define PWR_PUCRH_PH0_Msk              (0x1UL << PWR_PUCRH_PH0_Pos)            /*!< 0x00000001 */
#define PWR_PUCRH_PH0                  PWR_PUCRH_PH0_Msk                       /*!< Pin PH0 Pull-Up set */
#define PWR_PUCRH_PH1_Pos              (1U)
#define PWR_PUCRH_PH1_Msk              (0x1UL << PWR_PUCRH_PH1_Pos)            /*!< 0x00000002 */
#define PWR_PUCRH_PH1                  PWR_PUCRH_PH1_Msk                       /*!< Pin PH1 Pull-Up set */
#endif
#define PWR_PUCRH_PH3_Pos              (3U)
#define PWR_PUCRH_PH3_Msk              (0x1UL << PWR_PUCRH_PH3_Pos)            /*!< 0x00000004 */
#define PWR_PUCRH_PH3                  PWR_PUCRH_PH3_Msk                       /*!< Pin PH3 Pull-Up set */

