STMicroelectronics/x-cube-memsmic1/Drivers/CMSIS/Device/ST/STM32WBxx/Include/stm32WBxxxxx.h
/********************  Bit definition for PWR_PDCRH register  *****************/
#if defined (STM32WB55xx) || defined (STM32WB35xx) || defined(STM32WB5Mxx)
#define PWR_PDCRH_PH0_Pos              (0U)
#define PWR_PDCRH_PH0_Msk              (0x1UL << PWR_PDCRH_PH0_Pos)            /*!< 0x00000001 */
#define PWR_PDCRH_PH0                  PWR_PDCRH_PH0_Msk                       /*!< Pin PH0 Pull-Down set */
#define PWR_PDCRH_PH1_Pos              (1U)
#define PWR_PDCRH_PH1_Msk              (0x1UL << PWR_PDCRH_PH1_Pos)            /*!< 0x00000002 */
#define PWR_PDCRH_PH1                  PWR_PDCRH_PH1_Msk                       /*!< Pin PH1 Pull-Down set */
#endif
#define PWR_PDCRH_PH3_Pos              (3U)
#define PWR_PDCRH_PH3_Msk              (0x1UL << PWR_PDCRH_PH3_Pos)            /*!< 0x00000004 */
#define PWR_PDCRH_PH3                  PWR_PDCRH_PH3_Msk                       /*!< Pin PH3 Pull-Down set */

/********************  Bit definition for PWR_C2CR1 register  ********************/
#define PWR_C2CR1_LPMS_Pos             (0U)
#define PWR_C2CR1_LPMS_Msk             (0x7UL << PWR_C2CR1_LPMS_Pos)           /*!< 0x00000007 */
#define PWR_C2CR1_LPMS                 PWR_C2CR1_LPMS_Msk                      /*!< Low Power Mode Selection for CPU2 */
#define PWR_C2CR1_LPMS_0               (0x1U << PWR_C2CR1_LPMS_Pos)            /*!< 0x00000001 */
#define PWR_C2CR1_LPMS_1               (0x2U << PWR_C2CR1_LPMS_Pos)            /*!< 0x00000002 */
#define PWR_C2CR1_LPMS_2               (0x4U << PWR_C2CR1_LPMS_Pos)            /*!< 0x00000004 */

#define PWR_C2CR1_FPDR_Pos             (4U)
#define PWR_C2CR1_FPDR_Msk             (0x1UL << PWR_C2CR1_FPDR_Pos)           /*!< 0x00000010 */
#define PWR_C2CR1_FPDR                 PWR_C2CR1_FPDR_Msk                      /*!< Flash power down mode during LPrun for CPU2 */

#define PWR_C2CR1_FPDS_Pos             (5U)
#define PWR_C2CR1_FPDS_Msk             (0x1UL << PWR_C2CR1_FPDS_Pos)           /*!< 0x00000020 */
#define PWR_C2CR1_FPDS                 PWR_C2CR1_FPDS_Msk                      /*!< Flash power down mode during LPsleep for CPU2 */

#define PWR_C2CR1_BLEEWKUP_Pos         (14U)
#define PWR_C2CR1_BLEEWKUP_Msk         (0x1UL << PWR_C2CR1_BLEEWKUP_Pos)       /*!< 0x00008000 */
#define PWR_C2CR1_BLEEWKUP             PWR_C2CR1_BLEEWKUP_Msk                  /*!< Radio BLE external wakeup signal */

#if defined (STM32WB15xx) || defined (STM32WB10xx) || defined(STM32WB1Mxx)
#else
#define PWR_C2CR1_802EWKUP_Pos         (15U)
#define PWR_C2CR1_802EWKUP_Msk         (0x1UL << PWR_C2CR1_802EWKUP_Pos)       /*!< 0x00008000 */
#define PWR_C2CR1_802EWKUP             PWR_C2CR1_802EWKUP_Msk                  /*!< Radio 802.15.4 external wakeup signal */

#endif
/********************  Bit definition for PWR_C2CR3 register  ********************/
#if defined (STM32WB55xx) || defined(STM32WB5Mxx)
#define PWR_C2CR3_EWUP_Pos             (0U)
#define PWR_C2CR3_EWUP_Msk             (0x1FUL << PWR_C2CR3_EWUP_Pos)           /*!< 0x0000001F */
#define PWR_C2CR3_EWUP                 PWR_C2CR3_EWUP_Msk                       /*!< Enable all external Wake-Up lines for CPU2 */
#define PWR_C2CR3_EWUP1_Pos            (0U)
#define PWR_C2CR3_EWUP1_Msk            (0x1UL << PWR_C2CR3_EWUP1_Pos)           /*!< 0x00000001 */
#define PWR_C2CR3_EWUP1                PWR_C2CR3_EWUP1_Msk                      /*!< Enable external WKUP Pin 1 [line 0] for CPU2 */
#define PWR_C2CR3_EWUP2_Pos            (1U)
#define PWR_C2CR3_EWUP2_Msk            (0x1UL << PWR_C2CR3_EWUP2_Pos)           /*!< 0x00000002 */
#define PWR_C2CR3_EWUP2                PWR_C2CR3_EWUP2_Msk                      /*!< Enable external WKUP Pin 2 [line 1] for CPU2 */
#define PWR_C2CR3_EWUP3_Pos            (2U)
#define PWR_C2CR3_EWUP3_Msk            (0x1UL << PWR_C2CR3_EWUP3_Pos)           /*!< 0x00000004 */
#define PWR_C2CR3_EWUP3                PWR_C2CR3_EWUP3_Msk                      /*!< Enable external WKUP Pin 3 [line 2] for CPU2 */
#define PWR_C2CR3_EWUP4_Pos            (3U)
#define PWR_C2CR3_EWUP4_Msk            (0x1UL << PWR_C2CR3_EWUP4_Pos)           /*!< 0x00000008 */
#define PWR_C2CR3_EWUP4                PWR_C2CR3_EWUP4_Msk                      /*!< Enable external WKUP Pin 4 [line 3] for CPU2 */
#define PWR_C2CR3_EWUP5_Pos            (4U)
#define PWR_C2CR3_EWUP5_Msk            (0x1UL << PWR_C2CR3_EWUP5_Pos)           /*!< 0x00000010 */
#define PWR_C2CR3_EWUP5                PWR_C2CR3_EWUP5_Msk                      /*!< Enable external WKUP Pin 5 [line 4] for CPU2 */
#elif defined (STM32WB50xx) || defined (STM32WB35xx) || defined (STM32WB30xx) || defined (STM32WB25xx) || defined (STM32WB20xx) || defined (STM32WB15xx) || defined (STM32WB10xx) || defined(STM32WB1Mxx)
#define PWR_C2CR3_EWUP_Pos             (0U)
#define PWR_C2CR3_EWUP_Msk             (0x09UL << PWR_C2CR3_EWUP_Pos)           /*!< 0x00000009 */
#define PWR_C2CR3_EWUP                 PWR_C2CR3_EWUP_Msk                       /*!< Enable all external Wake-Up lines for CPU2 */
#define PWR_C2CR3_EWUP1_Pos            (0U)
#define PWR_C2CR3_EWUP1_Msk            (0x1UL << PWR_C2CR3_EWUP1_Pos)           /*!< 0x00000001 */
#define PWR_C2CR3_EWUP1                PWR_C2CR3_EWUP1_Msk                      /*!< Enable external WKUP Pin 1 [line 0] for CPU2 */
#define PWR_C2CR3_EWUP4_Pos            (3U)
#define PWR_C2CR3_EWUP4_Msk            (0x1UL << PWR_C2CR3_EWUP4_Pos)           /*!< 0x00000008 */
#define PWR_C2CR3_EWUP4                PWR_C2CR3_EWUP4_Msk                      /*!< Enable external WKUP Pin 4 [line 3] for CPU2 */
#endif

#define PWR_C2CR3_EBLEWUP_Pos          (9U)
#define PWR_C2CR3_EBLEWUP_Msk          (0x1UL << PWR_C2CR3_EBLEWUP_Pos)       /*!< 0x00000200 */
#define PWR_C2CR3_EBLEWUP              PWR_C2CR3_EBLEWUP_Msk                 /*!< Enable BLE host wakeup interrupt for CPU2 */
#if defined (STM32WB15xx) || defined (STM32WB10xx) || defined(STM32WB1Mxx)
#else
#define PWR_C2CR3_E802WUP_Pos          (10U)
#define PWR_C2CR3_E802WUP_Msk          (0x1UL << PWR_C2CR3_E802WUP_Pos)       /*!< 0x00000400 */
#define PWR_C2CR3_E802WUP              PWR_C2CR3_E802WUP_Msk                  /*!< Enable BLE host wakeup interrupt for CPU2 */
#endif

