STMicroelectronics/x-cube-memsmic1/Drivers/CMSIS/Device/ST/STM32WBxx/Include/stm32WBxxxxx.h
#define RCC_BDCR_LSCOEN_Pos                 (24U)
#define RCC_BDCR_LSCOEN_Msk                 (0x1UL << RCC_BDCR_LSCOEN_Pos)     /*!< 0x01000000 */
#define RCC_BDCR_LSCOEN                     RCC_BDCR_LSCOEN_Msk
#define RCC_BDCR_LSCOSEL_Pos                (25U)
#define RCC_BDCR_LSCOSEL_Msk                (0x1UL << RCC_BDCR_LSCOSEL_Pos)    /*!< 0x02000000 */
#define RCC_BDCR_LSCOSEL                    RCC_BDCR_LSCOSEL_Msk

/********************  Bit definition for RCC_CSR register  *******************/
#define RCC_CSR_LSI1ON_Pos                  (0U)
#define RCC_CSR_LSI1ON_Msk                  (0x1UL << RCC_CSR_LSI1ON_Pos)      /*!< 0x00000001 */
#define RCC_CSR_LSI1ON                      RCC_CSR_LSI1ON_Msk
#define RCC_CSR_LSI1RDY_Pos                 (1U)
#define RCC_CSR_LSI1RDY_Msk                 (0x1UL << RCC_CSR_LSI1RDY_Pos)     /*!< 0x00000002 */
#define RCC_CSR_LSI1RDY                     RCC_CSR_LSI1RDY_Msk
#define RCC_CSR_LSI2ON_Pos                  (2U)
#define RCC_CSR_LSI2ON_Msk                  (0x1UL << RCC_CSR_LSI2ON_Pos)      /*!< 0x00000004 */
#define RCC_CSR_LSI2ON                      RCC_CSR_LSI2ON_Msk
#define RCC_CSR_LSI2RDY_Pos                 (3U)
#define RCC_CSR_LSI2RDY_Msk                 (0x1UL << RCC_CSR_LSI2RDY_Pos)     /*!< 0x00000008 */
#define RCC_CSR_LSI2RDY                     RCC_CSR_LSI2RDY_Msk
#define RCC_CSR_LSI2TRIM_Pos                (8U)
#define RCC_CSR_LSI2TRIM_Msk                (0xFUL << RCC_CSR_LSI2TRIM_Pos)      /*!< 0x00000F00 */
#define RCC_CSR_LSI2TRIM                    RCC_CSR_LSI2TRIM_Msk
#define RCC_CSR_LSI2TRIM_0                  (0x1U << RCC_CSR_LSI2TRIM_Pos)       /*!< 0x00000100 */
#define RCC_CSR_LSI2TRIM_1                  (0x2U << RCC_CSR_LSI2TRIM_Pos)       /*!< 0x00000200 */
#define RCC_CSR_LSI2TRIM_2                  (0x4U << RCC_CSR_LSI2TRIM_Pos)       /*!< 0x00000400 */
#define RCC_CSR_LSI2TRIM_3                  (0x8U << RCC_CSR_LSI2TRIM_Pos)       /*!< 0x00000800 */
#define RCC_CSR_RFWKPSEL_Pos                (14U)
#define RCC_CSR_RFWKPSEL_Msk                (0x3UL << RCC_CSR_RFWKPSEL_Pos)    /*!< 0x0000C000 */
#define RCC_CSR_RFWKPSEL                    RCC_CSR_RFWKPSEL_Msk
#define RCC_CSR_RFWKPSEL_0                  (0x1U << RCC_CSR_RFWKPSEL_Pos)     /*!< 0x00004000 */
#define RCC_CSR_RFWKPSEL_1                  (0x2U << RCC_CSR_RFWKPSEL_Pos)     /*!< 0x00008000 */
#define RCC_CSR_RFRSTS_Pos                  (16U)
#define RCC_CSR_RFRSTS_Msk                  (0x1UL << RCC_CSR_RFRSTS_Pos)      /*!< 0x00010000 */
#define RCC_CSR_RFRSTS                      RCC_CSR_RFRSTS_Msk
#define RCC_CSR_RMVF_Pos                    (23U)
#define RCC_CSR_RMVF_Msk                    (0x1UL << RCC_CSR_RMVF_Pos)        /*!< 0x00800000 */
#define RCC_CSR_RMVF                        RCC_CSR_RMVF_Msk
#define RCC_CSR_OBLRSTF_Pos                 (25U)
#define RCC_CSR_OBLRSTF_Msk                 (0x1UL << RCC_CSR_OBLRSTF_Pos)     /*!< 0x02000000 */
#define RCC_CSR_OBLRSTF                     RCC_CSR_OBLRSTF_Msk
#define RCC_CSR_PINRSTF_Pos                 (26U)
#define RCC_CSR_PINRSTF_Msk                 (0x1UL << RCC_CSR_PINRSTF_Pos)     /*!< 0x04000000 */
#define RCC_CSR_PINRSTF                     RCC_CSR_PINRSTF_Msk
#define RCC_CSR_BORRSTF_Pos                 (27U)
#define RCC_CSR_BORRSTF_Msk                 (0x1UL << RCC_CSR_BORRSTF_Pos)     /*!< 0x08000000 */
#define RCC_CSR_BORRSTF                     RCC_CSR_BORRSTF_Msk
#define RCC_CSR_SFTRSTF_Pos                 (28U)
#define RCC_CSR_SFTRSTF_Msk                 (0x1UL << RCC_CSR_SFTRSTF_Pos)     /*!< 0x10000000 */
#define RCC_CSR_SFTRSTF                     RCC_CSR_SFTRSTF_Msk
#define RCC_CSR_IWDGRSTF_Pos                (29U)
#define RCC_CSR_IWDGRSTF_Msk                (0x1UL << RCC_CSR_IWDGRSTF_Pos)     /*!< 0x20000000 */
#define RCC_CSR_IWDGRSTF                    RCC_CSR_IWDGRSTF_Msk
#define RCC_CSR_WWDGRSTF_Pos                (30U)
#define RCC_CSR_WWDGRSTF_Msk                (0x1UL << RCC_CSR_WWDGRSTF_Pos)    /*!< 0x40000000 */
#define RCC_CSR_WWDGRSTF                    RCC_CSR_WWDGRSTF_Msk
#define RCC_CSR_LPWRRSTF_Pos                (31U)
#define RCC_CSR_LPWRRSTF_Msk                (0x1UL << RCC_CSR_LPWRRSTF_Pos)    /*!< 0x80000000 */
#define RCC_CSR_LPWRRSTF                    RCC_CSR_LPWRRSTF_Msk

#if defined(STM32WB55xx) || defined (STM32WB35xx) || defined(STM32WB5Mxx) || defined(STM32WB50xx) || defined (STM32WB30xx) || defined(STM32WB25xx) || defined(STM32WB20xx)
/********************  Bit definition for RCC_CRRCR register  *******************/
#define RCC_CRRCR_HSI48ON_Pos               (0U)
#define RCC_CRRCR_HSI48ON_Msk               (0x1UL << RCC_CRRCR_HSI48ON_Pos)    /*!< 0x00000001 */
#define RCC_CRRCR_HSI48ON                   RCC_CRRCR_HSI48ON_Msk
#define RCC_CRRCR_HSI48RDY_Pos              (1U)
#define RCC_CRRCR_HSI48RDY_Msk              (0x1UL << RCC_CRRCR_HSI48RDY_Pos)   /*!< 0x00000002 */
#define RCC_CRRCR_HSI48RDY                  RCC_CRRCR_HSI48RDY_Msk
#define RCC_CRRCR_HSI48CAL_Pos              (7U)
#define RCC_CRRCR_HSI48CAL_Msk              (0x1FFUL << RCC_CRRCR_HSI48CAL_Pos) /*!< 0x0000FF80 */
#define RCC_CRRCR_HSI48CAL                  RCC_CRRCR_HSI48CAL_Msk
#define RCC_CRRCR_HSI48CAL_0                (0x001U << RCC_CRRCR_HSI48CAL_Pos)  /*!< 0x00000080 */
#define RCC_CRRCR_HSI48CAL_1                (0x002U << RCC_CRRCR_HSI48CAL_Pos)  /*!< 0x00000100 */
#define RCC_CRRCR_HSI48CAL_2                (0x004U << RCC_CRRCR_HSI48CAL_Pos)  /*!< 0x00000200 */
#define RCC_CRRCR_HSI48CAL_3                (0x008U << RCC_CRRCR_HSI48CAL_Pos)  /*!< 0x00000400 */
#define RCC_CRRCR_HSI48CAL_4                (0x010U << RCC_CRRCR_HSI48CAL_Pos)  /*!< 0x00000800 */
#define RCC_CRRCR_HSI48CAL_5                (0x020U << RCC_CRRCR_HSI48CAL_Pos)  /*!< 0x00001000 */
#define RCC_CRRCR_HSI48CAL_6                (0x040U << RCC_CRRCR_HSI48CAL_Pos)  /*!< 0x00002000 */
#define RCC_CRRCR_HSI48CAL_7                (0x080U << RCC_CRRCR_HSI48CAL_Pos)  /*!< 0x00004000 */
#define RCC_CRRCR_HSI48CAL_8                (0x100U << RCC_CRRCR_HSI48CAL_Pos)  /*!< 0x00008000 */

#endif
/********************  Bit definition for RCC_HSECR register  *******************/
#define RCC_HSECR_UNLOCKED_Pos              (0U)
#define RCC_HSECR_UNLOCKED_Msk              (0x1UL << RCC_HSECR_UNLOCKED_Pos)  /*!< 0x00000001 */
#define RCC_HSECR_UNLOCKED                  RCC_HSECR_UNLOCKED_Msk

#define RCC_HSECR_HSES_Pos                  (3U)
#define RCC_HSECR_HSES_Msk                  (0x1UL << RCC_HSECR_HSES_Pos)      /*!< 0x00000008 */
#define RCC_HSECR_HSES                      RCC_HSECR_HSES_Msk

#define RCC_HSECR_HSEGMC_Pos                (4U)
#define RCC_HSECR_HSEGMC_Msk                (0x7UL << RCC_HSECR_HSEGMC_Pos)       /*!< 0x00000070 */
#define RCC_HSECR_HSEGMC                    RCC_HSECR_HSEGMC_Msk
#define RCC_HSECR_HSEGMC0_Pos               (4U)
#define RCC_HSECR_HSEGMC0_Msk               (0x1UL << RCC_HSECR_HSEGMC0_Pos)      /*!< 0x00000010 */
#define RCC_HSECR_HSEGMC0                   RCC_HSECR_HSEGMC0_Msk
#define RCC_HSECR_HSEGMC1_Pos               (5U)
#define RCC_HSECR_HSEGMC1_Msk               (0x1UL << RCC_HSECR_HSEGMC1_Pos)      /*!< 0x00000020 */
#define RCC_HSECR_HSEGMC1                   RCC_HSECR_HSEGMC1_Msk
#define RCC_HSECR_HSEGMC2_Pos               (6U)
#define RCC_HSECR_HSEGMC2_Msk               (0x1UL << RCC_HSECR_HSEGMC2_Pos)      /*!< 0x00000040 */
#define RCC_HSECR_HSEGMC2                   RCC_HSECR_HSEGMC2_Msk

