STMicroelectronics/x-cube-memsmic1/Drivers/CMSIS/Device/ST/STM32WBxx/Include/stm32WBxxxxx.h
/*******************  Bit definition for TIM1_OR register  *******************/
#define TIM1_OR_ETR_ADC1_RMP_Pos      (0U)
#define TIM1_OR_ETR_ADC1_RMP_Msk      (0x3UL << TIM1_OR_ETR_ADC1_RMP_Pos)    /*!< 0x00000003 */
#define TIM1_OR_ETR_ADC1_RMP          TIM1_OR_ETR_ADC1_RMP_Msk               /*!< TIM1_ETR_ADC1 remapping capability*/
#define TIM1_OR_ETR_ADC1_RMP_0        (0x1U << TIM1_OR_ETR_ADC1_RMP_Pos)     /*!< 0x00000001 */
#define TIM1_OR_ETR_ADC1_RMP_1        (0x2U << TIM1_OR_ETR_ADC1_RMP_Pos)     /*!< 0x00000002 */
#define TIM1_OR_TI1_RMP_Pos            (4U)
#define TIM1_OR_TI1_RMP_Msk            (0x1UL << TIM1_OR_TI1_RMP_Pos)          /*!< 0x00000010 */
#define TIM1_OR_TI1_RMP                TIM1_OR_TI1_RMP_Msk                     /*!< Input Capture 1 remap*/

/*******************  Bit definition for TIM2_OR register  *******************/
#if defined(STM32WB55xx) || defined (STM32WB35xx) || defined(STM32WB5Mxx) || defined(STM32WB25xx)
#define TIM2_OR_TI4_RMP_Pos      (2U)
#define TIM2_OR_TI4_RMP_Msk      (0x3UL << TIM2_OR_TI4_RMP_Pos)              /*!< 0x0000000C */
#define TIM2_OR_TI4_RMP          TIM2_OR_TI4_RMP_Msk                         /*!< TI4 RMP[1:0]Input capture 4 remap*/
#define TIM2_OR_TI4_RMP_0        (0x1U << TIM2_OR_TI4_RMP_Pos)               /*!< 0x00000004 */
#define TIM2_OR_TI4_RMP_1        (0x2U << TIM2_OR_TI4_RMP_Pos)               /*!< 0x00000008 */
#elif defined (STM32WB15xx) || defined (STM32WB10xx) || defined(STM32WB1Mxx)
#define TIM2_OR_TI4_RMP_Pos      (2U)
#define TIM2_OR_TI4_RMP_Msk      (0x3UL << TIM2_OR_TI4_RMP_Pos)              /*!< 0x0000000C */
#define TIM2_OR_TI4_RMP          TIM2_OR_TI4_RMP_Msk                         /*!< TI4 Input capture 4 remap*/
#define TIM2_OR_TI4_RMP_0        (0x1U << TIM2_OR_TI4_RMP_Pos)               /*!< 0x00000004 */
#endif
#define TIM2_OR_ETR_RMP_Pos      (1U)
#define TIM2_OR_ETR_RMP_Msk      (0x1UL << TIM2_OR_ETR_RMP_Pos)              /*!< 0x00000002 */
#define TIM2_OR_ETR_RMP          TIM2_OR_ETR_RMP_Msk                         /*!< External trigger remap*/
#if defined(STM32WB55xx) || defined (STM32WB35xx) || defined(STM32WB5Mxx) ||  defined(STM32WB25xx)
#define TIM2_OR_ITR1_RMP_Pos     (0U)
#define TIM2_OR_ITR1_RMP_Msk     (0x1UL << TIM2_OR_ITR1_RMP_Pos)             /*!< 0x00000001 */
#define TIM2_OR_ITR1_RMP         TIM2_OR_ITR1_RMP_Msk                        /*!< Internal trigger remap*/
#endif

#if defined(STM32WB55xx) || defined (STM32WB35xx) || defined(STM32WB5Mxx) || defined(STM32WB50xx) || defined (STM32WB30xx) || defined(STM32WB25xx) || defined(STM32WB20xx)
/*******************  Bit definition for TIM16_OR register  ******************/
#define TIM16_OR_TI1_RMP_Pos      (0U)
#define TIM16_OR_TI1_RMP_Msk      (0x3UL << TIM16_OR_TI1_RMP_Pos)            /*!< 0x00000003 */
#define TIM16_OR_TI1_RMP          TIM16_OR_TI1_RMP_Msk                       /*!<Timer 16 input 1 connection. */
#define TIM16_OR_TI1_RMP_0        (0x1U << TIM16_OR_TI1_RMP_Pos)             /*!< 0x00000001 */
#define TIM16_OR_TI1_RMP_1        (0x2U << TIM16_OR_TI1_RMP_Pos)             /*!< 0x00000002 */

/*******************  Bit definition for TIM17_OR register  ******************/
#define TIM17_OR_TI1_RMP_Pos      (0U)
#define TIM17_OR_TI1_RMP_Msk      (0x3UL << TIM17_OR_TI1_RMP_Pos)            /*!< 0x00000003 */
#define TIM17_OR_TI1_RMP          TIM17_OR_TI1_RMP_Msk                       /*!<Timer 17 input 1 connection. */
#define TIM17_OR_TI1_RMP_0        (0x1U << TIM17_OR_TI1_RMP_Pos)             /*!< 0x00000001 */
#define TIM17_OR_TI1_RMP_1        (0x2U << TIM17_OR_TI1_RMP_Pos)             /*!< 0x00000002 */

#endif
/*******************  Bit definition for TIM1_AF1 register  *******************/
#define TIM1_AF1_BKINE_Pos             (0U)
#define TIM1_AF1_BKINE_Msk             (0x1UL << TIM1_AF1_BKINE_Pos)           /*!< 0x00000001 */
#define TIM1_AF1_BKINE                 TIM1_AF1_BKINE_Msk                      /*!<BRK BKIN input enable */
#if defined (STM32WB55xx) || defined (STM32WB35xx) || defined(STM32WB5Mxx) || defined (STM32WB25xx) || defined (STM32WB15xx) || defined (STM32WB10xx) || defined(STM32WB1Mxx)
#define TIM1_AF1_BKCMP1E_Pos           (1U)
#define TIM1_AF1_BKCMP1E_Msk           (0x1UL << TIM1_AF1_BKCMP1E_Pos)         /*!< 0x00000002 */
#define TIM1_AF1_BKCMP1E               TIM1_AF1_BKCMP1E_Msk                    /*!<BRK COMP1 enable */
#endif
#if defined (STM32WB55xx) || defined (STM32WB35xx) || defined(STM32WB5Mxx) || defined (STM32WB25xx)
#define TIM1_AF1_BKCMP2E_Pos           (2U)
#define TIM1_AF1_BKCMP2E_Msk           (0x1UL << TIM1_AF1_BKCMP2E_Pos)         /*!< 0x00000004 */
#define TIM1_AF1_BKCMP2E               TIM1_AF1_BKCMP2E_Msk                    /*!<BRK COMP2 enable */
#endif
#define TIM1_AF1_BKINP_Pos             (9U)
#define TIM1_AF1_BKINP_Msk             (0x1UL << TIM1_AF1_BKINP_Pos)           /*!< 0x00000200 */
#define TIM1_AF1_BKINP                 TIM1_AF1_BKINP_Msk                      /*!<BRK BKIN input polarity */
#if defined (STM32WB55xx) || defined (STM32WB35xx) || defined(STM32WB5Mxx) || defined (STM32WB25xx) || defined (STM32WB15xx) || defined (STM32WB10xx) || defined(STM32WB1Mxx)
#define TIM1_AF1_BKCMP1P_Pos           (10U)
#define TIM1_AF1_BKCMP1P_Msk           (0x1UL << TIM1_AF1_BKCMP1P_Pos)         /*!< 0x00000400 */
#define TIM1_AF1_BKCMP1P               TIM1_AF1_BKCMP1P_Msk                    /*!<BRK COMP1 input polarity */
#endif
#if defined (STM32WB55xx) || defined (STM32WB35xx) || defined(STM32WB5Mxx) || defined (STM32WB25xx)
#define TIM1_AF1_BKCMP2P_Pos           (11U)
#define TIM1_AF1_BKCMP2P_Msk           (0x1UL << TIM1_AF1_BKCMP2P_Pos)         /*!< 0x00000800 */
#define TIM1_AF1_BKCMP2P               TIM1_AF1_BKCMP2P_Msk                    /*!<BRK COMP2 input polarity */
#endif
#define TIM1_AF1_ETRSEL_Pos            (14U)
#define TIM1_AF1_ETRSEL_Msk            (0x7UL << TIM1_AF1_ETRSEL_Pos)          /*!< 0x0001C000 */
#define TIM1_AF1_ETRSEL                TIM1_AF1_ETRSEL_Msk                     /*!<ETRSEL[2:0] bits (TIM1 ETR source selection) */
#define TIM1_AF1_ETRSEL_0              (0x1U << TIM1_AF1_ETRSEL_Pos)           /*!< 0x00004000 */
#define TIM1_AF1_ETRSEL_1              (0x2U << TIM1_AF1_ETRSEL_Pos)           /*!< 0x00008000 */
#define TIM1_AF1_ETRSEL_2              (0x4U << TIM1_AF1_ETRSEL_Pos)           /*!< 0x00010000 */

/*******************  Bit definition for TIM2_AF1 register  *******************/
#define TIM2_AF1_ETRSEL_Pos       (14U)
#define TIM2_AF1_ETRSEL_Msk       (0x7UL << TIM2_AF1_ETRSEL_Pos)               /*!< 0x0001C000 */
#define TIM2_AF1_ETRSEL           (0x00001C000)                                /*!< External trigger source selection */
#define TIM2_AF1_ETRSEL_0         (0x000004000)                                /*!< Bit_0 */
#define TIM2_AF1_ETRSEL_1         (0x000008000)                                /*!< Bit_1 */
#define TIM2_AF1_ETRSEL_2         (0x000010000)                                /*!< Bit_2 */

#if defined(STM32WB55xx) || defined (STM32WB35xx) || defined(STM32WB5Mxx) || defined(STM32WB50xx) || defined (STM32WB30xx) || defined(STM32WB25xx) || defined(STM32WB20xx)
/*******************  Bit definition for TIM16_AF1 register  *******************/
#define TIM16_AF1_BKINE_Pos            (0U)
#define TIM16_AF1_BKINE_Msk            (0x1UL << TIM16_AF1_BKINE_Pos)           /*!< 0x00000001 */
#define TIM16_AF1_BKINE                 TIM16_AF1_BKINE_Msk                     /*!<BRK BKIN input enable */
#if defined (STM32WB55xx) || defined (STM32WB35xx) || defined(STM32WB5Mxx) || defined (STM32WB25xx)
#define TIM16_AF1_BKCMP1E_Pos          (1U)
#define TIM16_AF1_BKCMP1E_Msk          (0x1UL << TIM16_AF1_BKCMP1E_Pos)        /*!< 0x00000002 */
#define TIM16_AF1_BKCMP1E              TIM16_AF1_BKCMP1E_Msk                   /*!<BRK COMP1 enable */
#define TIM16_AF1_BKCMP2E_Pos          (2U)
#define TIM16_AF1_BKCMP2E_Msk          (0x1UL << TIM16_AF1_BKCMP2E_Pos)        /*!< 0x00000004 */
#define TIM16_AF1_BKCMP2E              TIM16_AF1_BKCMP2E_Msk                   /*!<BRK COMP2 enable */
#endif
#define TIM16_AF1_BKINP_Pos            (9U)
#define TIM16_AF1_BKINP_Msk            (0x1UL << TIM16_AF1_BKINP_Pos)          /*!< 0x00000200 */
#define TIM16_AF1_BKINP                TIM16_AF1_BKINP_Msk                     /*!<BRK BKIN2 input polarity */
#if defined (STM32WB55xx) || defined (STM32WB35xx) || defined(STM32WB5Mxx) || defined (STM32WB25xx)
#define TIM16_AF1_BKCMP1P_Pos          (10U)
#define TIM16_AF1_BKCMP1P_Msk          (0x1UL << TIM16_AF1_BKCMP1P_Pos)        /*!< 0x00000400 */
#define TIM16_AF1_BKCMP1P              TIM16_AF1_BKCMP1P_Msk                   /*!<BRK COMP1 input polarity */
#define TIM16_AF1_BKCMP2P_Pos          (11U)
#define TIM16_AF1_BKCMP2P_Msk          (0x1UL << TIM16_AF1_BKCMP2P_Pos)        /*!< 0x00000800 */
#define TIM16_AF1_BKCMP2P              TIM16_AF1_BKCMP2P_Msk                   /*!<BRK COMP2 input polarity */
#endif

#endif
/*******************  Bit definition for TIM17_AF1 register  *******************/
#define TIM17_AF1_BKINE_Pos             (0U)
#define TIM17_AF1_BKINE_Msk             (0x1UL << TIM17_AF1_BKINE_Pos)           /*!< 0x00000001 */
#define TIM17_AF1_BKINE                 TIM17_AF1_BKINE_Msk                      /*!<BRK BKIN input enable */
#if defined (STM32WB55xx) || defined (STM32WB35xx) || defined(STM32WB5Mxx) || defined (STM32WB25xx)
#define TIM17_AF1_BKCMP1E_Pos          (1U)
#define TIM17_AF1_BKCMP1E_Msk          (0x1UL << TIM17_AF1_BKCMP1E_Pos)        /*!< 0x00000002 */
#define TIM17_AF1_BKCMP1E              TIM17_AF1_BKCMP1E_Msk                   /*!<BRK COMP1 enable */
#define TIM17_AF1_BKCMP2E_Pos          (2U)
#define TIM17_AF1_BKCMP2E_Msk          (0x1UL << TIM17_AF1_BKCMP2E_Pos)        /*!< 0x00000004 */
#define TIM17_AF1_BKCMP2E              TIM17_AF1_BKCMP2E_Msk                   /*!<BRK COMP2 enable */
#endif
#define TIM17_AF1_BKINP_Pos            (9U)
#define TIM17_AF1_BKINP_Msk            (0x1UL << TIM17_AF1_BKINP_Pos)          /*!< 0x00000200 */
#define TIM17_AF1_BKINP                TIM17_AF1_BKINP_Msk                     /*!<BRK BKIN2 input polarity */
#if defined (STM32WB55xx) || defined (STM32WB35xx) || defined(STM32WB5Mxx) || defined (STM32WB25xx)
#define TIM17_AF1_BKCMP1P_Pos          (10U)
#define TIM17_AF1_BKCMP1P_Msk          (0x1UL << TIM17_AF1_BKCMP1P_Pos)        /*!< 0x00000400 */
#define TIM17_AF1_BKCMP1P              TIM17_AF1_BKCMP1P_Msk                   /*!<BRK COMP1 input polarity */
#define TIM17_AF1_BKCMP2P_Pos          (11U)
#define TIM17_AF1_BKCMP2P_Msk          (0x1UL << TIM17_AF1_BKCMP2P_Pos)        /*!< 0x00000800 */
#define TIM17_AF1_BKCMP2P              TIM17_AF1_BKCMP2P_Msk                   /*!<BRK COMP2 input polarity */
#endif

/*******************  Bit definition for TIM1_AF2 register  *******************/
#define TIM1_AF2_BK2INE_Pos            (0U)
#define TIM1_AF2_BK2INE_Msk            (0x1UL << TIM1_AF2_BK2INE_Pos)          /*!< 0x00000001 */
#define TIM1_AF2_BK2INE                TIM1_AF2_BK2INE_Msk                     /*!<BRK2 BKIN2 input enable */
#if defined (STM32WB55xx) || defined (STM32WB35xx) || defined(STM32WB5Mxx) || defined (STM32WB25xx) || defined (STM32WB15xx) || defined (STM32WB10xx) || defined(STM32WB1Mxx)
#define TIM1_AF2_BK2CMP1E_Pos          (1U)
#define TIM1_AF2_BK2CMP1E_Msk          (0x1UL << TIM1_AF2_BK2CMP1E_Pos)        /*!< 0x00000002 */
#define TIM1_AF2_BK2CMP1E              TIM1_AF2_BK2CMP1E_Msk                   /*!<BRK2 COMP1 enable */
#endif
#if defined (STM32WB55xx) || defined (STM32WB35xx) || defined(STM32WB5Mxx) || defined (STM32WB25xx)
#define TIM1_AF2_BK2CMP2E_Pos          (2U)
#define TIM1_AF2_BK2CMP2E_Msk          (0x1UL << TIM1_AF2_BK2CMP2E_Pos)        /*!< 0x00000004 */
#define TIM1_AF2_BK2CMP2E              TIM1_AF2_BK2CMP2E_Msk                   /*!<BRK2 COMP2 enable */
#endif
#define TIM1_AF2_BK2INP_Pos            (9U)
#define TIM1_AF2_BK2INP_Msk            (0x1UL << TIM1_AF2_BK2INP_Pos)          /*!< 0x00000200 */
#define TIM1_AF2_BK2INP                TIM1_AF2_BK2INP_Msk                     /*!<BRK2 BKIN2 input polarity */
#if defined (STM32WB55xx) || defined (STM32WB35xx) || defined(STM32WB5Mxx) || defined (STM32WB25xx) || defined (STM32WB15xx) || defined (STM32WB10xx) || defined(STM32WB1Mxx)
#define TIM1_AF2_BK2CMP1P_Pos          (10U)
#define TIM1_AF2_BK2CMP1P_Msk          (0x1UL << TIM1_AF2_BK2CMP1P_Pos)        /*!< 0x00000400 */
#define TIM1_AF2_BK2CMP1P              TIM1_AF2_BK2CMP1P_Msk                   /*!<BRK2 COMP1 input polarity */
#endif
#if defined (STM32WB55xx) || defined (STM32WB35xx) || defined(STM32WB5Mxx) || defined (STM32WB25xx)
#define TIM1_AF2_BK2CMP2P_Pos          (11U)
#define TIM1_AF2_BK2CMP2P_Msk          (0x1UL << TIM1_AF2_BK2CMP2P_Pos)        /*!< 0x00000800 */
#define TIM1_AF2_BK2CMP2P              TIM1_AF2_BK2CMP2P_Msk                   /*!<BRK2 COMP2 input polarity */
#endif

/******************************************************************************/
/*                                                                            */
/*                         Low Power Timer (LPTIM)                            */
/*                                                                            */
/******************************************************************************/

/******************  Bit definition for LPTIM_ISR register  *******************/
#define LPTIM_ISR_CMPM_Pos          (0U)
#define LPTIM_ISR_CMPM_Msk          (0x1UL << LPTIM_ISR_CMPM_Pos)              /*!< 0x00000001 */
#define LPTIM_ISR_CMPM              LPTIM_ISR_CMPM_Msk                         /*!< Compare match */
#define LPTIM_ISR_ARRM_Pos          (1U)
#define LPTIM_ISR_ARRM_Msk          (0x1UL << LPTIM_ISR_ARRM_Pos)              /*!< 0x00000002 */
#define LPTIM_ISR_ARRM              LPTIM_ISR_ARRM_Msk                         /*!< Autoreload match */
#define LPTIM_ISR_EXTTRIG_Pos       (2U)
#define LPTIM_ISR_EXTTRIG_Msk       (0x1UL << LPTIM_ISR_EXTTRIG_Pos)           /*!< 0x00000004 */
#define LPTIM_ISR_EXTTRIG           LPTIM_ISR_EXTTRIG_Msk                      /*!< External trigger edge event */
#define LPTIM_ISR_CMPOK_Pos         (3U)
#define LPTIM_ISR_CMPOK_Msk         (0x1UL << LPTIM_ISR_CMPOK_Pos)             /*!< 0x00000008 */
#define LPTIM_ISR_CMPOK             LPTIM_ISR_CMPOK_Msk                        /*!< Compare register update OK */
#define LPTIM_ISR_ARROK_Pos         (4U)
#define LPTIM_ISR_ARROK_Msk         (0x1UL << LPTIM_ISR_ARROK_Pos)             /*!< 0x00000010 */
#define LPTIM_ISR_ARROK             LPTIM_ISR_ARROK_Msk                        /*!< Autoreload register update OK */
#define LPTIM_ISR_UP_Pos            (5U)
#define LPTIM_ISR_UP_Msk            (0x1UL << LPTIM_ISR_UP_Pos)                /*!< 0x00000020 */
#define LPTIM_ISR_UP                LPTIM_ISR_UP_Msk                           /*!< Counter direction change down to up */
#define LPTIM_ISR_DOWN_Pos          (6U)
#define LPTIM_ISR_DOWN_Msk          (0x1UL << LPTIM_ISR_DOWN_Pos)              /*!< 0x00000040 */
#define LPTIM_ISR_DOWN              LPTIM_ISR_DOWN_Msk                         /*!< Counter direction change up to down */

/******************  Bit definition for LPTIM_ICR register  *******************/
#define LPTIM_ICR_CMPMCF_Pos        (0U)
#define LPTIM_ICR_CMPMCF_Msk        (0x1UL << LPTIM_ICR_CMPMCF_Pos)            /*!< 0x00000001 */
#define LPTIM_ICR_CMPMCF            LPTIM_ICR_CMPMCF_Msk                       /*!< Compare match Clear Flag */
#define LPTIM_ICR_ARRMCF_Pos        (1U)
#define LPTIM_ICR_ARRMCF_Msk        (0x1UL << LPTIM_ICR_ARRMCF_Pos)            /*!< 0x00000002 */
#define LPTIM_ICR_ARRMCF            LPTIM_ICR_ARRMCF_Msk                       /*!< Autoreload match Clear Flag */
#define LPTIM_ICR_EXTTRIGCF_Pos     (2U)
#define LPTIM_ICR_EXTTRIGCF_Msk     (0x1UL << LPTIM_ICR_EXTTRIGCF_Pos)         /*!< 0x00000004 */
#define LPTIM_ICR_EXTTRIGCF         LPTIM_ICR_EXTTRIGCF_Msk                    /*!< External trigger edge event Clear Flag */
#define LPTIM_ICR_CMPOKCF_Pos       (3U)
#define LPTIM_ICR_CMPOKCF_Msk       (0x1UL << LPTIM_ICR_CMPOKCF_Pos)           /*!< 0x00000008 */
#define LPTIM_ICR_CMPOKCF           LPTIM_ICR_CMPOKCF_Msk                      /*!< Compare register update OK Clear Flag */
#define LPTIM_ICR_ARROKCF_Pos       (4U)
#define LPTIM_ICR_ARROKCF_Msk       (0x1UL << LPTIM_ICR_ARROKCF_Pos)           /*!< 0x00000010 */
#define LPTIM_ICR_ARROKCF           LPTIM_ICR_ARROKCF_Msk                      /*!< Autoreload register update OK Clear Flag */
#define LPTIM_ICR_UPCF_Pos          (5U)
#define LPTIM_ICR_UPCF_Msk          (0x1UL << LPTIM_ICR_UPCF_Pos)              /*!< 0x00000020 */
#define LPTIM_ICR_UPCF              LPTIM_ICR_UPCF_Msk                         /*!< Counter direction change down to up Clear Flag */
#define LPTIM_ICR_DOWNCF_Pos        (6U)
#define LPTIM_ICR_DOWNCF_Msk        (0x1UL << LPTIM_ICR_DOWNCF_Pos)            /*!< 0x00000040 */
#define LPTIM_ICR_DOWNCF            LPTIM_ICR_DOWNCF_Msk                       /*!< Counter direction change up to down Clear Flag */

/******************  Bit definition for LPTIM_IER register ********************/
#define LPTIM_IER_CMPMIE_Pos        (0U)
#define LPTIM_IER_CMPMIE_Msk        (0x1UL << LPTIM_IER_CMPMIE_Pos)            /*!< 0x00000001 */
#define LPTIM_IER_CMPMIE            LPTIM_IER_CMPMIE_Msk                       /*!< Compare match Interrupt Enable */
#define LPTIM_IER_ARRMIE_Pos        (1U)
#define LPTIM_IER_ARRMIE_Msk        (0x1UL << LPTIM_IER_ARRMIE_Pos)            /*!< 0x00000002 */
#define LPTIM_IER_ARRMIE            LPTIM_IER_ARRMIE_Msk                       /*!< Autoreload match Interrupt Enable */
#define LPTIM_IER_EXTTRIGIE_Pos     (2U)
#define LPTIM_IER_EXTTRIGIE_Msk     (0x1UL << LPTIM_IER_EXTTRIGIE_Pos)         /*!< 0x00000004 */
#define LPTIM_IER_EXTTRIGIE         LPTIM_IER_EXTTRIGIE_Msk                    /*!< External trigger edge event Interrupt Enable */
#define LPTIM_IER_CMPOKIE_Pos       (3U)
#define LPTIM_IER_CMPOKIE_Msk       (0x1UL << LPTIM_IER_CMPOKIE_Pos)           /*!< 0x00000008 */
#define LPTIM_IER_CMPOKIE           LPTIM_IER_CMPOKIE_Msk                      /*!< Compare register update OK Interrupt Enable */
#define LPTIM_IER_ARROKIE_Pos       (4U)
#define LPTIM_IER_ARROKIE_Msk       (0x1UL << LPTIM_IER_ARROKIE_Pos)           /*!< 0x00000010 */
#define LPTIM_IER_ARROKIE           LPTIM_IER_ARROKIE_Msk                      /*!< Autoreload register update OK Interrupt Enable */
#define LPTIM_IER_UPIE_Pos          (5U)
#define LPTIM_IER_UPIE_Msk          (0x1UL << LPTIM_IER_UPIE_Pos)              /*!< 0x00000020 */
#define LPTIM_IER_UPIE              LPTIM_IER_UPIE_Msk                         /*!< Counter direction change down to up Interrupt Enable */
#define LPTIM_IER_DOWNIE_Pos        (6U)
#define LPTIM_IER_DOWNIE_Msk        (0x1UL << LPTIM_IER_DOWNIE_Pos)            /*!< 0x00000040 */
#define LPTIM_IER_DOWNIE            LPTIM_IER_DOWNIE_Msk                       /*!< Counter direction change up to down Interrupt Enable */

